/*TASK 1
Ми розглянули реалізацію стеку фіксованого розміру на звичайному масиві;
обговорили реалізацію стеку змінного розміру(аж до нескінченного) на масиві, розташованому у динамічній пам'яті; 
виявили недоліки такого стеку(витрати часу на копіювання та пікове споживання пам'яті щоразу при збільшенні розміру стеку і, 
як наслідок першого -- зростання часу pop() / push() при збільшенні розміру стеку );
та знайшли рішення, позбавлене цих недоліків -- стек, побудований з об'єктів автореферентного класу (точніше, структури) Node.
("автореферентний клас" означає "клас, кожен об'єкт якого містить вказівник на інший об'єкт цього ж класу")

	Для закріплення пропонується виконати наступну задачу :*/

/*
Напишіть програму з трьома класами - автомат, магазин, набій.

Кожен набій пронумерований(нумерація послідовна і при запуску програми починається з випадкового числа)
і вміє вистрілюватися і влучати в мішень з імовірністю 70 % .

Магазин реалізований у вигляді стеку, містить 30 набоїв.
і вміє :
заряджати набій(отримує його "готовим")
віддавати набій(верхній)

Автомат вміє :
прийняти магазин
стріляти - попросити магазин дати 1 набій, і, якщо дав, попросити набій вистрелити(набій при цьому скаже, чи влучив, 
а автомат передасть результат "нагору")
*/

/*TASK 2
Побудувати клас  для роботи з однозв’язним списком(class BusList).
Елемент списку містить наступну інформацію про автобус(class Bus) :
номер автобуса;
прізвище та ініціали водія;
номер маршруту.

На основу класу BusList написати клас AutoPark
котрий  повинен забезпечувати :
початкове формування двох списків :
з даними про автобуси, які знаходяться в автопарку;
з даними про автобуси, які знаходяться на маршрутах.

При виїзді кожного автобуса з автопарку програма видаляє дані про цей автобус зі списку автобусів, які знаходяться в автопарку, 
та записує ці дані в список автобусів, які знаходяться на маршруті.

Якщо якийсь автобус повертається в автопарк, виконується протилежна операція

Виведення відомостей про автобуси, які знаходяться в автопарку

Виведення відомостей про автобуси, які знаходяться на маршруті.

Клас AutoPark керується з меню.
Команди:
купити автобус -- новий автобус додається до автопарку
продати автобус -- обраний автобус видаляється з автопарку
на маршрут -- обраний автобус видаляється з автопарку і додається до списку на маршруті
на стоянку -- обраний автобус видаляється зі списку на маршруті і додається до списку Автопарку

Обирати автобус можна двома шляхами :
запитати його номер у списку,
або реалізувати вибір автобуса клавішами курсора(вгору / донизу) обраний автобус підсвічується інверсним кольором*/