/*Есть компания, у компании могут быть сотрудники.
Сотрудник характеризуется:
именем, 
датой поступления на работу, 
базовой ставкой(для простоты, это значение по - умолчанию одинаково для всех видов сотрудников).

Сотрудники бывают 3 видов - Employee, Manager, Seller.
У каждого сотрудника может быть начальник.
У сотрудников(кроме Employee) может быть любое количество подчинённых любого вида.

Зарплата сотрудника Seller - это базовая ставка плюс 1 % за каждый год работы в компании
(но не больше 35 % суммарной надбавки) плюс 0, 3 % зарплаты всех подчинённых  всех уровней

Зарплата сотрудника Manager - это базовая ставка плюс 5 % за каждый год работы в компании
(но не больше 40 % суммарной надбавки) плюс 0, 5 % зарплаты всех подчинённых первого уровня

Зарплата сотрудника Employee - это базовая ставка плюс 3 % за каждый год работы в компании,
но не больше 30 % суммарной надбавки

Требуется: составить архитектуру классов на C++, описывающих данную модель, 
а также реализовать алгоритм расчета зарплаты каждого сотрудника на произвольный момент времени
(а также подсчёт суммарной зарплаты всех сотрудников фирмы в целом).*/

/*Описати клас "Fortress" (Фортеця).

Для початку, напишіть клас "Shooter" (стрілець), який буде містити два поля : назва амуніції та її кількість.
Він може виконати дію "постріл" і
витратити для цього одиницю амуніції, повідомляючи в консоль, як вона називалась.
А також може здійснити дію "дати амуніцію",
яка встановлюватиме назву і кількість амуніції, отримуючи ці дані через параметри.

Стрілець має три дочірні класи : "Archer" (Лучник), "Ranger" (Рейнджер)та "Catapult" (Катапульта),
які заміщають дію "постріл",
доповнюючи повідомлення в консоль інформацією про те, хто саме з них вистрілив.Перші два повинні
стріляти стрілами, а катапульта - каменями.

Від перших двох породжується клас "ArcherTower" (Cтрілецька вежа), у якої запас амуніції має бути
один(спільний) для обох :
лучника і рейнджера(подумайте, який механізм множинного успадкування тут варто застосувати).

Від класів "стрілкова вежа" і "катапульта" має походити клас "Fortress".Лише в її конструкторі
мають поставлятись стріли для
стрілкової вежі і камені для катапульти.Додайте до фортеці ще кілька полів - товщина стін,
стан воріт у відсотках, і т.д. - на Ваше бажання та фантазію.

Більше ніяких допоміжних методів чи об'єктів створювати не потрібно. В кожного з полів чи методів 
у цій ієрархії має бути
встановлений максимальний рівень захисту, і успадкування має відбуватись по найвищо - допустимому
по захисту специфікаторові доступу.
Але таким, щоб в main() можна було виконати наступне :

створити об'єкт фортеці
вистрілити тричі лучником, двічі рейнджером і раз з катапульти

Отже, всього має бути 6 класів, вінцем творіння і фінальним дитям серед них є клас "Фортеця",
лише один об'єкт якої буде створено. 

Зверніть на це увагу - 6 класів описано, всі використовуються.Але об'єкт у всій програмі один

ПРИМІТКИ!Коли створюватиметься фортеця, доставте в стрілкову вежу лише 4 стріли, тоді буде явно видно,
що на другий постріл
рейнджеру стріл не вистачить, оскільки лучник перед тим витратив 3 із 4 - х стріл.*/